; domain
(define (domain AUV)
(:requirements :typing :equality)
(:types vehicle location resource - object
        auv ship - vehicle
)

(:predicates (at ?v - vehicle ?l - location)
             (connected ?l1 ?l2 - location)
             (at-res ?r - resource ?l - location)
             (sampled ?r - resource)
             (free ?l - location)
             (operational ?a - auv)
             (connected-ship ?s - ship ?l1 ?l2 - location)
             
)

(:action move
:parameters (?a - auv ?l1 ?l2 - location)
:precondition (and (at ?a ?l1)
                   (operational ?a)
                   (connected ?l1 ?l2)
                   (free ?l2)
                
              )
:effect (and (not (at ?a ?l1))
             (at ?a ?l2)
             (free ?l1)
             (not (free ?l2))
        )
)

(:action sample
:parameters (?a - auv ?r - resource ?l - location)
:precondition (and (at ?a ?l)
                   (at-res ?r ?l)
                   (operational ?a)
              )
:effect (and (sampled ?r)
        )
)


)

; problem
(define (problem AUV-problem-3x3-2)
(:domain AUV)
(:objects
l-1-1 l-2-1 l-3-1 l-1-2 l-2-2 l-3-2 l-1-3 l-2-3 l-3-3 - location
r1 - resource
a - auv
s1 - ship
)
(:init
(operational a)
(at a l-1-2)
(connected l-1-1 l-2-1)
(connected l-2-1 l-1-1)
(connected l-1-1 l-1-2)
(connected l-1-2 l-1-1)
(connected l-2-1 l-3-1)
(connected l-3-1 l-2-1)
(connected l-2-1 l-2-2)
(connected l-2-2 l-2-1)
(connected l-3-1 l-3-2)
(connected l-3-2 l-3-1)
(connected l-1-2 l-2-2)
(connected l-2-2 l-1-2)
(connected l-1-2 l-1-3)
(connected l-1-3 l-1-2)
(connected l-2-2 l-3-2)
(connected l-3-2 l-2-2)
(connected l-2-2 l-2-3)
(connected l-2-3 l-2-2)
(connected l-3-2 l-3-3)
(connected l-3-3 l-3-2)
(connected l-1-3 l-2-3)
(connected l-2-3 l-1-3)
(connected l-2-3 l-3-3)
(connected l-3-3 l-2-3)
(at-res r1 l-3-2)
(at s1 l-2-2)
(connected-ship s1 l-2-1 l-2-2)
(connected-ship s1 l-2-2 l-2-1)
(connected-ship s1 l-2-2 l-2-3)
(connected-ship s1 l-2-3 l-2-2)
(free l-1-1)
(free l-3-1)
(free l-2-1)
(free l-3-2)
(free l-1-3)
(free l-2-3)
(free l-3-3)
)
(:goal
(and
(operational a)
(sampled r1)
(at a l-1-2)
)
)
)

; plan
1. (move a l-1-2 l-1-1)
   deleted: (at a l-1-2) (free l-1-1)
   added: (at a l-1-1) (free l-1-2)
   goals met: 1 of 3
2. (move a l-1-1 l-2-1)
   deleted: (at a l-1-1) (free l-2-1)
   added: (at a l-2-1) (free l-1-1)
   goals met: 1 of 3
3. (move a l-2-1 l-3-1)
   deleted: (at a l-2-1) (free l-3-1)
   added: (at a l-3-1) (free l-2-1)
   goals met: 1 of 3
4. (move a l-3-1 l-3-2)
   deleted: (at a l-3-1) (free l-3-2)
   added: (at a l-3-2) (free l-3-1)
   goals met: 1 of 3
5. (sample a r1 l-3-2)
   added: (sampled r1)
   goals met: 2 of 3
6. (move a l-3-2 l-3-1)
   deleted: (at a l-3-2) (free l-3-1)
   added: (at a l-3-1) (free l-3-2)
   goals met: 2 of 3
7. (move a l-3-1 l-2-1)
   deleted: (at a l-3-1) (free l-2-1)
   added: (at a l-2-1) (free l-3-1)
   goals met: 2 of 3
8. (move a l-2-1 l-1-1)
   deleted: (at a l-2-1) (free l-1-1)
   added: (at a l-1-1) (free l-2-1)
   goals met: 2 of 3
9. (move a l-1-1 l-1-2)
   deleted: (at a l-1-1) (free l-1-2)
   added: (at a l-1-2) (free l-1-1)
   goals met: 3 of 3
